Documents/csys1_Письма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>csys1_Письма</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ТекстыПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйТекстПерсонал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ТекстыПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйТекстТранспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ТекстыПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйТекстИнструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.csys1_ТекстыПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструмент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.csys1_Инструмент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/csys1_Письма/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.csys1_Письма.ПолучитьМакет("Печать");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	csys1_Письма.Номер КАК Номер,
		|	csys1_Письма.Дата КАК Дата,
		|	csys1_Письма.Контрагент КАК Контрагент,
		|	csys1_Письма.Организация КАК Организация,
		|	csys1_Письма.Организация.НаименованиеСокращенное КАК ОрганизацияНаименование,
		|	csys1_Письма.Организация.ФайлЛоготип КАК ОрганизацияФайлЛоготип,
		|   csys1_Письма.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|
		|	ОсновнойТекст.Наименование КАК ВидПисьмаНаименование,
		|	ОсновнойТекст.ТекстПисьма КАК ТекстПисьма,
		|
		|	ТекстПерсонал.ТекстПисьма КАК ТекстПерсонал,
		|	ТекстТранспорт.ТекстПисьма КАК ТекстТранспорт,
		|	ТекстИнструмент.ТекстПисьма КАК ТекстИнструмент,
		|
		|	csys1_Письма.ДополнительныйТекст КАК ДополнительныйТекст
		|ИЗ
		|	Документ.csys1_Письма КАК csys1_Письма
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.csys1_ТекстыПисем КАК ОсновнойТекст
		|		ПО csys1_Письма.ТекстПисьма = ОсновнойТекст.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.csys1_ТекстыПисем КАК ТекстПерсонал
		|		ПО csys1_Письма.ДополнительныйТекстПерсонал = ТекстПерсонал.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.csys1_ТекстыПисем КАК ТекстТранспорт
		|		ПО csys1_Письма.ДополнительныйТекстТранспорт = ТекстТранспорт.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.csys1_ТекстыПисем КАК ТекстИнструмент
		|		ПО csys1_Письма.ДополнительныйТекстИнструмент = ТекстИнструмент.Ссылка
		|ГДЕ
		|	csys1_Письма.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ТабДок.Очистить();
	ТабДок.АвтоМасштаб = Истина;

	ОбъектПисьма = ПолучитьОбъектПисьмаПоПараметру(Ссылка);

	ВставлятьРазделительСтраниц = Ложь;

	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВывестиШапку(ТабДок, Макет, Выборка);
		ВывестиПисьмо(ТабДок, Макет, Выборка);
		ВывестиПерсонал(ТабДок, Макет, Выборка, ОбъектПисьма);
		ВывестиИнструмент(ТабДок, Макет, Выборка, ОбъектПисьма);
		ВывестиТранспорт(ТабДок, Макет, Выборка, ОбъектПисьма);
		ВывестиПодпись(ТабДок, Макет, Выборка, ОбъектПисьма);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;

КонецПроцедуры     

Процедура ВывестиШапку(ТабДок, Макет, Выборка)
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ЗаполнитьЛоготипОрганизации(Шапка, Выборка);
	
	Шапка.Параметры.ОрганизацияНаименование = Выборка.ОрганизацияНаименование;
	Шапка.Параметры.ЮридическийАдрес = ПолучитьАдресОрганизации(Выборка.Организация, "юр");
	Шапка.Параметры.ФактическийАдрес = ПолучитьАдресОрганизации(Выборка.Организация, "факт");
	Шапка.Параметры.ИНН = Выборка.Организация.ИНН;
	Шапка.Параметры.КПП = Выборка.Организация.КПП;
	Шапка.Параметры.Телефон = ПолучитьКонтактОрганизации(Выборка.Организация, "тел");
	
	ТабДок.Вывести(Шапка);
	
КонецПроцедуры

Процедура ЗаполнитьЛоготипОрганизации(Шапка, Выборка)
	
	Если НЕ ЗначениеЗаполнено(Выборка.ОрганизацияФайлЛоготип) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ОрганизацияФайлЛоготип);

		Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
			КартинкаЛоготипа = Новый Картинка(ДвоичныеДанные);
			Шапка.Рисунки.Логотип.Картинка = КартинкаЛоготипа;
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка получения логотипа: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВывестиПисьмо(ТабДок, Макет, Выборка)
	
	Письмо = Макет.ПолучитьОбласть("Письмо");
	Письмо.Параметры.Номер = Формат(Число(Выборка.Номер), "ЧГ=0");
	Письмо.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=Д");
	
	Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
		Письмо.Параметры.КонтрагентНаименование = Выборка.Контрагент.НаименованиеПолное;
	Иначе
		Письмо.Параметры.КонтрагентНаименование = "";
	КонецЕсли;
	
	ФИО = Выборка.Контрагент.КонтактноеЛицо;
	Если ЗначениеЗаполнено(ФИО) Тогда
		Результат = СклонениеПредставленийОбъектов.ПросклонятьПредставление(
    	ФИО, 3);
		Письмо.Параметры.КонтрагентДолжность = Результат;
	Иначе
		Письмо.Параметры.КонтрагентДолжность = "";
	КонецЕсли;
		
	
	Письмо.Параметры.ВидПисьма = Выборка.ВидПисьмаНаименование;
	Письмо.Параметры.ТекстНаименованияДоговора = ПолучитьТекстНаименованияДоговора(Выборка);
	Письмо.Параметры.ТекстПисьма = Выборка.ТекстПисьма;
	Письмо.Параметры.ДополнительныйТекст = Выборка.ДополнительныйТекст;
	
	ТабДок.Вывести(Письмо);
	
КонецПроцедуры

Функция ПолучитьТекстНаименованияДоговора(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ДоговорКонтрагента) Тогда
		
		НаименованиеДоговора = НРег(СокрЛП(Выборка.ДоговорКонтрагента.Наименование));
		
		Если ЗначениеЗаполнено(НаименованиеДоговора) Тогда
			
			ДатаДоговора = Выборка.ДоговорКонтрагента.ДатаДоговора;
			НомерДоговора = Выборка.ДоговорКонтрагента.НомерДоговора;
			СтрокаДатаНомер = " № " + НомерДоговора + " от " + Формат(ДатаДоговора, "ДЛФ=Д");
			
			Если СтрНайти(НаименованиеДоговора, "дог") > 0 Тогда
				Возврат Символы.ПС + "         На основании договора" + СтрокаДатаНомер + "." +Символы.ПС + " ";
				
			ИначеЕсли СтрНайти(НаименованиеДоговора, "контракт") > 0 Тогда
				Возврат Символы.ПС + "         На основании контракта" + СтрокаДатаНомер + "." + Символы.ПС + " ";
			КонецЕсли;
			
			ИначеЕсли СтрНайти(НаименованиеДоговора, "соглаш") > 0 Тогда
				Возврат Символы.ПС + "         На основании контракта" + СтрокаДатаНомер + "." + Символы.ПС + " ";
			Иначе
				Возврат Символы.ПС + "         На основании договора" + СтрокаДатаНомер + "." +Символы.ПС + " ";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ВывестиПерсонал(ТабДок, Макет, Выборка, ОбъектПисьма)
	
	Если НЕ ЗначениеЗаполнено(Выборка.ТекстПерсонал) Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ПерсоналОбласть = Макет.ПолучитьОбласть("ПерсоналОбласть");
	ПерсоналОбласть.Параметры.ДополнительныйТекстПерсонал = Выборка.ТекстПерсонал;
	
	ТабДок.Вывести(ПерсоналОбласть);
	
	Счетчик = 0;
	СчетчикВкл = НуженНомер(ОбъектПисьма.Персонал);
	
	Для Каждого СтрокаТЧ Из ОбъектПисьма.Персонал Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник.ФизическоеЛицо) Тогда
			Счетчик = Счетчик + 1;
		
			ПерсоналСтрока = Макет.ПолучитьОбласть("ПерсоналСтрока");

			Если СчетчикВкл Тогда 
				ПерсоналСтрока.Параметры.Номер = НомерСТочкой(Счетчик);
			КонецЕсли;
		    	
			ПерсоналСтрока.Параметры.Сотрудник = ПолучитьФИОПерсонала(СтрокаТЧ.Сотрудник);
			ПерсоналСтрока.Параметры.ДатаРождения = Формат(ПолучитьДатуРождения(СтрокаТЧ.Сотрудник), "ДЛФ=Д");
			ПерсоналСтрока.Параметры.Документ = ПредставлениеДокументаФизическогоЛица(СтрокаТЧ.Сотрудник.ФизическоеЛицо);
		    		
			ТабДок.Вывести(ПерсоналСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиИнструмент(ТабДок, Макет, Выборка, ОбъектПисьма)
	
	Если НЕ ЗначениеЗаполнено(Выборка.ТекстИнструмент) Тогда
		Возврат;
	КонецЕсли;
	         
	ИнструментОбласть = Макет.ПолучитьОбласть("ИнструментОбласть");
	ИнструментОбласть.Параметры.ДополнительныйТекстИнструмент = Выборка.ТекстИнструмент;
	ТабДок.Вывести(ИнструментОбласть);
	
	Счетчик = 0;
	СчетчикВкл = НуженНомер(ОбъектПисьма.Инструмент); 
	
	Для Каждого СтрокаТЧ Из ОбъектПисьма.Инструмент Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Инструмент) Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		ИнструментСтрока = Макет.ПолучитьОбласть("ИнструментСтрока");
		
		Если СчетчикВкл Тогда 
			ИнструментСтрока.Параметры.Номер = НомерСТочкой(Счетчик);
		КонецЕсли;
		
		ИнструментСтрока.Параметры.Инструмент = ПолучитьПредставлениеИнструмент(СтрокаТЧ.Инструмент);
		ТабДок.Вывести(ИнструментСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиТранспорт(ТабДок, Макет, Выборка, ОбъектПисьма)
	
	Если НЕ ЗначениеЗаполнено(Выборка.ТекстТранспорт) Тогда
		Возврат;
	КонецЕсли;
	         
	ТранспортОбласть = Макет.ПолучитьОбласть("ТранспортОбласть");
	ТранспортОбласть.Параметры.ДополнительныйТекстТранспорт = Выборка.ТекстТранспорт;
	ТабДок.Вывести(ТранспортОбласть);
	
	Счетчик = 0;
	
	
	
	Для Каждого СтрокаТЧ Из ОбъектПисьма.Транспорт Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТранспортноеСредство) Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		СчетчикВкл = НуженНомер(ОбъектПисьма.Транспорт);
		
		ТранспортСтрока = Макет.ПолучитьОбласть("ТранспортСтрока");
		
		Если СчетчикВкл Тогда 
			ТранспортСтрока.Параметры.Номер = НомерСТочкой(Счетчик);
		КонецЕсли;
		ТранспортСтрока.Параметры.Транспорт = СтрокаТЧ.ТранспортноеСредство.Наименование;
		ТабДок.Вывести(ТранспортСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПодпись(ТабДок, Макет, Выборка, ОбъектПисьма)
	ПодписьОбласть = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Вывести(ПодписьОбласть);
КонецПроцедуры

Функция ПолучитьОбъектПисьмаПоПараметру(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("Массив") Тогда
		
		Если Ссылка.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Ссылка[0].ПолучитьОбъект();
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СписокЗначений") Тогда
		
		Если Ссылка.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Ссылка[0].Значение.ПолучитьОбъект();
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда
		
		Возврат Ссылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьФИОПерсонала(Сотрудник)
	Если ЗначениеЗаполнено(Сотрудник.ФизическоеЛицо) Тогда
		
		Если ЗначениеЗаполнено(Сотрудник.ФизическоеЛицо.ФИО) Тогда
			Возврат Сотрудник.ФизическоеЛицо.ФИО;
		КонецЕсли;
		
		Возврат Сотрудник.ФизическоеЛицо.Наименование;
			
	КонецЕсли;
	
	Попытка
		Возврат Сотрудник.Наименование;
	Исключение
	КонецПопытки;
	
	Возврат Строка(Сотрудник);
	
КонецФункции

Функция ПолучитьДатуРождения(Сотрудник)
	Если ЗначениеЗаполнено(Сотрудник.ФизическоеЛицо.ДатаРождения) Тогда
		Возврат Сотрудник.ФизическоеЛицо.ДатаРождения;
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ПолучитьПредставлениеИнструмент(Инструмент)
	Если НЕ ЗначениеЗаполнено(Инструмент) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(Инструмент.Наименование) Тогда
			Если ЗначениеЗаполнено(Инструмент.СерийныйНомер) Тогда
				Возврат Строка(Инструмент.Наименование + " SN: " + Инструмент.СерийныйНомер);
			КонецЕсли;
			Возврат Инструмент.Наименование;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат "";
КонецФункции

Функция ПолучитьПаспортныеДанныеСотрудника(Сотрудник)
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(Сотрудник.ФизическоеЛицо) Тогда
			Если ЗначениеЗаполнено(Сотрудник.ФизическоеЛицо.Документ) Тогда
				Возврат Сотрудник.ФизическоеЛицо.Документ;
			КонецЕсли;
			
			Возврат Строка("Не заполнен документ");
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Строка("Проблемы с заполнением");	
КонецФункции     

Функция ПредставлениеДокументаФизическогоЛица(ФизическоеЛицо)
	
	ТекстПусто = НСтр("ru = 'Заполнить сведения паспорта (другого документа)'");
	Если НЕ ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат ТекстПусто;
	КонецЕсли;
	
	ЗапросПоДокументамФизЛиц = Новый Запрос;
	ЗапросПоДокументамФизЛиц.Текст =
		"ВЫБРАТЬ
		|   ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
		|   ДокументыФизическихЛицСрезПоследних.Представление КАК Представление
		|ИЗ
		|   РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|   ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизическоеЛицо";

	ЗапросПоДокументамФизЛиц.УстановитьПараметр(
	    "ФизическоеЛицо",
	    ФизическоеЛицо
	);

	Выборка = ЗапросПоДокументамФизЛиц.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Строка("Документ не заполнен.");
	КонецЕсли; 
	Возврат Строка(Выборка.Представление);

КонецФункции

Функция ПолучитьАдресОрганизации(Организация, ТипАдреса)

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;

	Если ТипАдреса = "юр" Тогда
		Условие = "%юр%адрес%";
	Иначе
		Условие = "%факт%адрес%";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Организация
	|	И КонтактнаяИнформация.Вид.Наименование ПОДОБНО &Условие";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Условие", Условие);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПолучитьКонтактОрганизации(Организация, ТипКонтакта)

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;

	Если ТипКонтакта = "тел" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Организация
		|	И КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""%тел%""";

	ИначеЕсли ТипКонтакта = "email" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Организация
		|	И (
		|		КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""%электрон%""
		|		ИЛИ КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""%email%""
		|		ИЛИ КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""%e-mail%""
		|		ИЛИ КонтактнаяИнформация.Вид.Наименование ПОДОБНО ""%почт%""
		|	)";

	Иначе

		Возврат "";

	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;

	Возврат "";

КонецФункции

Функция УбратьЛидирующиеНули(НомерДокумента)
	
	Попытка
		НомерДокумента = Формат(Число(НомерДокумента), "ЧГ=");
	Исключение
		НомерДокумента = СтрЗаменить(СокрЛ(СтрЗаменить(СокрП(НомерДокумента), "0", " ")), " ", "0");
	КонецПопытки;
	
	Возврат НомерДокумента;
	
КонецФункции

Функция НомерСТочкой(Число)
	Возврат Строка(Число) + ".";	
КонецФункции

Функция НуженНомер(ТабличнаяЧасть)
	Если ТабличнаяЧасть.Количество() > 1 Тогда
		Возврат Истина
	КонецЕсли;
	Возврат Ложь;
КонецФункции
